Documents/Отправка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Отправка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОтправкаИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтправкаИнвойсов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОжидаемыеПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СкорректированныеИнвойсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СкорректированныеИнвойсы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтрокИнвойса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Отправка/Forms/ФормаДокумента/Ext/Form/Module.bsl
// © Primus1C  20.11.2023  НАЧАЛО ►

#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;

	ОтобразитьТоварныеГруппы();
	
	ЗаполнитьКэшДанных();
	СформироватьГиперссылкиФайловНаФорме();
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	Элементы.ВалютаЗатрат.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	
	СтруктураПечатныхФорм = Документы.Отправка.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	УстановитьУсловноеОформление();
	
	//++
	ИсторияИзменений = Новый Структура("Шапка,ТЧ", Новый Массив, Новый Массив);
	Для каждого Рекв Из Метаданные.Документы.Отправка.Реквизиты Цикл
		ИсторияИзменений.Шапка.Добавить(Новый Структура("Имя,Синоним,Значение", Рекв.Имя, Рекв.Синоним, Объект[Рекв.Имя]));
	КонецЦикла;
    Для каждого ТЧ Из Метаданные.Документы.Отправка.ТабличныеЧасти Цикл
		Строки = Новый Массив;
		Строки.Добавить();
		
		ИсторияИзменений.ТЧ.Добавить(Новый Структура("Имя,Строки", ТЧ.Имя, Строки))	
	КонецЦикла;
	//--

	Элементы.ИнвойсыСумма.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Sum'"), ПараметрыСеанса.БазоваяВалюта.Символ);	
	
	ЗаполнитьДеревоЗначенийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	ОтобразитьЦветВалюты();
	ОбновитьИтоги();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// !! Функционал с выбором поставки выбранного инвойса --
	//
	//НедопоставкиИнвойса = НедопоставкиИнвойса(ВыбранноеЗначение); 
	//Если НедопоставкиИнвойса.Количество() = 0 Тогда
	//    клВнимание(НСтр("ru = 'По выбранной поставке все товары уже доставлены!'; en = 'For the selected delivery, all goods have already been delivered!'"), , НСтр("ru = 'Выбор поставки'; en = 'Delivery selection'"));
	//	Возврат;
	//ИначеЕсли НедопоставкиИнвойса.Количество() = 1 Тогда	
	//    ВыбраннаяПоставка = НедопоставкиИнвойса[0].Значение;
	//Иначе
	//	ВыбраннаяПоставка = клВариантСписка(НСтр("ru = 'Выберите поставку'; en = 'Select delivery'"), НедопоставкиИнвойса); 
	//	Если ВыбраннаяПоставка = Неопределено Тогда
	//	    Возврат;
	//	КонецЕсли;
	//КонецЕсли;                                                    
	//
	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбранноеЗначение)); 
	//Если НайдСтроки.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;        
	//НовСтрокаТЧ = Объект.Инвойсы.Добавить(); 
	//НовСтрокаТЧ.Инвойс 		= ВыбранноеЗначение; 
	//НовСтрокаТЧ.Поставка 	= ВыбраннаяПоставка;
	//ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ); 
	// 
	// -- !!
	
	Если ИсточникВыбора.ПоследнееОтправлено Тогда 
		//ИсточникВыбора.ТекущийЭлемент.ТекущиеДанные.НомерИнвойса
		клПредупреждение(НСтр("ru = 'Уже отправлено!'; en = 'Already sent!'"), 5, НСтр("ru = 'Выбор инвойса/поставки'; en = 'Selection the invoice/delivery'"));
		Возврат;
	КонецЕсли; 
	ВыбИнвойс 		= ИсточникВыбора.ПоследнийДокумент; 
	ВыбПоставка		= ИсточникВыбора.ПоследняяПоставка;

	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбИнвойс)); 
	НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс,Поставка", ВыбИнвойс, ВыбПоставка)); 
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;        
	НовСтрокаТЧ = Объект.Инвойсы.Добавить(); 
	НовСтрокаТЧ.Инвойс 		= ВыбИнвойс; 
	НовСтрокаТЧ.Поставка 	= ВыбПоставка;
	ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСтрокуПрикреплений" Тогда
		СформироватьГиперссылкиФайловНаФорме();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбора(Рез, Доп) Экспорт 
	//если ничего не выбрали, то в рез будет пусто...
	//Если НЕ Рез = Неопределено Тогда 
	//	Объект.ТабличнаяЧасть1.Добавить().Кво = Рез;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// проверка дублей строк
	Ошибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", СтрокаТЧ.Инвойс));
		Если НайдСтроки.ВГраница() > 0 Тогда  
			Стр = "";
			Для Инд = 0 По НайдСтроки.ВГраница() Цикл
				Стр = Стр + НайдСтроки[Инд].НомерСтроки + ", ";
			КонецЦикла;
			Ошибки.Вставить(СтрокаТЧ.Инвойс, Стр);
		КонецЕсли;	
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Найдены дубли в строках: '; en = 'Duplicates found in the lines: '") + Символы.ПС;
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 %2 - строки %3%4'; en = '%1 %2 - lines %3%4'"), ТекстОшибки, Ош.Ключ, Ош.Значение, Символы.ПС);
		КонецЦикла;
		ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-3);	
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	ЗаполнитьКэшДанных();
	ОбновитьИтоги();
	
КонецПроцедуры

#КонецОбласти         


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ВалютаЗатратПриИзменении(Элемент)
	
	ОтобразитьЦветВалюты();
КонецПроцедуры

#КонецОбласти 


#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ИнвойсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПослеУдаления(Элемент)

	ЗаполнитьКэшДанных();
	ОбновитьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыИнвойсПриИзменении(Элемент)
	
	ЗаполнитьДанныеСтрокиПоИнвойсу(Элементы.Инвойсы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораПоставок(СтрокаТЧ)

	КвоПоставок = КэшДанных.Инвойсы[СтрокаТЧ.Инвойс].КоличествоПоставокВИнвойсе;
	Если КвоПоставок = 0 Тогда
		//	//Поле.СписокВыбора.Добавить(0, "инвойс полностью");
	Иначе  
		ПолеПоставка = Элементы.Инвойсы.ПодчиненныеЭлементы.ИнвойсыПоставка;
		ПолеПоставка.СписокВыбора.Очистить();
		Для Инд = 1 По КвоПоставок Цикл     
			КвоВПоставке = КэшДанных.Инвойсы[СтрокаТЧ.Инвойс].ПоставкиИнвойсов[Инд].Количество;
			ПолеПоставка.СписокВыбора.Добавить(Инд, СтрШаблон(НСтр("ru = '%1 (из %2), кол-во %3'; en = '%1 (of %2), quantity %3'"), Инд, КвоПоставок, КвоВПоставке));
		КонецЦикла;
		Элементы.Инвойсы.ТекущиеДанные.Поставка = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСтрокиПоИнвойсу(СтрокаТЧ)
	
	ЗаполнитьКэшДанных();
	УстановитьКоличествоПоставки(СтрокаТЧ); 
	ОбновитьИтоги();
   	Модифицированность = Истина;
   
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПриАктивизацииЯчейки(Элемент)
	 
	Поле = Элемент.ТекущийЭлемент; 
	Если Поле.Имя = "ИнвойсыПоставка" Тогда
	
		Поле.СписокВыбора.Очистить();
		КвоПоставок = КэшДанных.Инвойсы[Элемент.ТекущиеДанные.Инвойс].КоличествоПоставокВИнвойсе;
		Если КвоПоставок = 0 Тогда
			//Поле.СписокВыбора.Добавить(0, "инвойс полностью");
		Иначе
			Для Инд = 1 По КвоПоставок Цикл   
				КвоВПоставке = КэшДанных.Инвойсы[Элемент.ТекущиеДанные.Инвойс].ПоставкиИнвойсов[Инд].Количество;
				Поле.СписокВыбора.Добавить(Инд, СтрШаблон(НСтр("ru = '%1 (из %2), кол-во %3'; en = '%1 (of %2), quantity %3'"), Инд, КвоПоставок, КвоВПоставке));
			КонецЦикла;
			//Элемент.ТекущиеДанные.Поставка = 1;
		КонецЕсли;	
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПоставкаПриИзменении(Элемент) 
	
	УстановитьКоличествоПоставки(Элементы.Инвойсы.ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоПоставки(ТекДанные)
	
	ДанныеПоставки = КэшДанных.Инвойсы[ТекДанные.Инвойс].ПоставкиИнвойсов[ТекДанные.Поставка]; 
	Если ДанныеПоставки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеПоставки, "Количество,Сумма,Статус"); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборИнвойсов(Команда)
	
	ОткрытьФорму("Документ._Инвойс.Форма.ФормаВыбораДоставки", 
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, ВыбранныеИнвойсы, ВидимостьКнопкиВыбора, ИспользоватьСписокОтправок",
						Ложь, Истина, Ложь, ИнвойсыДокумента(), Ложь, Истина), 
		ЭтаФорма,
		, , ,
		Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора", ЭтаФорма, "Подбор"), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаСервере
Функция ИнвойсыДокумента()
	
	Спис = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		Спис.Добавить(СтрШаблон("%1#%2", СтрокаТЧ.Инвойс.Номер, Формат(СтрокаТЧ.Поставка,"")));
	КонецЦикла;
	Возврат Спис;

КонецФункции 

&НаКлиенте
Процедура ОбновитьТЧ(Команда)
	
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		УстановитьКоличествоПоставки(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти                    


#Область РаботаСФайлами

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), 
																"НажатиеГиперссылкиФайла");

КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СтандартнаяОбработка = Ложь;
	НажатиеГиперссылкиФайла(Неопределено, СтандартнаяОбработка) 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	//Сообщить("Тип клиента: "+ПолучитьТипКлиента());
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Документ еще не записан. Записать его и прикрепить файл?'; en = 'The document has not yet been saved. Save it and attach the file?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			//Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		//Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры // ПолучитьРазмерФайла()

#КонецОбласти


#Область Служебные

&НаСервере
Функция НедопоставкиИнвойса(ИнвойсСсылка)
	
	СписокНедопоставок = Новый СписокЗначений;
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Инвойс", ИнвойсСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОтправкаИнвойсов.Поставка КАК Поставка,
	             |	СУММА(ОтправкаИнвойсов.Количество) КАК Количество,
	             |	СУММА(ОтправкаИнвойсов.Сумма) КАК Сумма
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |ГДЕ
	             |	ОтправкаИнвойсов.Инвойс = &Инвойс
	             //|	И ОтправкаИнвойсов.Поставка <> 0
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОтправкаИнвойсов.Поставка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Поставка";
	Выборка = Запр.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		СписокНедопоставок.Добавить(Выборка.Поставка, 
									СтрШаблон(НСтр("ru = 'Поставка %1: %2 %3 шт, сумма %4 %5'; en = 'Delivery %1: %2 %3 , sum %4 %5'"), 
												Выборка.Поставка, 
												?(Выборка.Количество < 0, НСтр("ru = 'отправлено'; en = 'sent'"), НСтр("ru = 'ожидается'; en = 'expected'")), 
												Выборка.Количество, 
												Выборка.Сумма, 
												ИнвойсСсылка.Валюта), ,
									?(Выборка.Количество <= 0, БиблиотекаКартинок.ДоставкаНеактивна, БиблиотекаКартинок.Доставка));
	КонецЦикла;
	
	Возврат СписокНедопоставок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКэшДанных()
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойсы", Объект.Инвойсы.Выгрузить().ВыгрузитьКолонку("Инвойс"));
	Запр.Текст = "ВЫБРАТЬ
	             |	МАКСИМУМ(_ИнвойсПоставки.Поставка) КАК Поставка,
	             |	_ИнвойсПоставки.Ссылка КАК Инвойс
	             |ИЗ
	             |	Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	             |ГДЕ
	             |	_ИнвойсПоставки.Ссылка В(&Инвойсы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ИнвойсПоставки.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	_Инвойс.Ссылка КАК Инвойс,
	             |	ЕСТЬNULL(_ИнвойсПоставки.Поставка, 0) КАК Поставка,
	             |	ВЫБОР
	             |		КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	             |			ТОГДА СкоррИнвойсы.КоличествоОборот
	             |		ИНАЧЕ СУММА(_ИнвойсПоставки.Количество)
	             |	КОНЕЦ КАК Количество,
	             |	ЕСТЬNULL(ВЫБОР
	             |		КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	             |			ТОГДА СкоррИнвойсы.СуммаОборот
	             |		ИНАЧЕ СУММА(_ИнвойсПоставки.Сумма)
	             |	КОНЕЦ, 0) КАК Сумма,
	             |	СостоянияИнвойсов.Статус
	             |ИЗ
	             |	Документ._Инвойс КАК _Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	             |		ПО (_ИнвойсПоставки.Ссылка = _Инвойс.Ссылка)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			СкорИнв.Инвойс КАК Инвойс,
	             |			СкорИнв.КоличествоОборот КАК КоличествоОборот,
	             |			СкорИнв.СуммаОборот КАК СуммаОборот
	             |		ИЗ
	             |			РегистрНакопления.СкорректированныеИнвойсы.Обороты(, , , Инвойс В (&Инвойсы)) КАК СкорИнв) КАК СкоррИнвойсы
	             |		ПО _Инвойс.Ссылка = СкоррИнвойсы.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО СостоянияИнвойсов.Инвойс = _Инвойс.Ссылка
	             |ГДЕ
	             |	_Инвойс.Ссылка В(&Инвойсы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ИнвойсПоставки.Поставка,
	             |	_Инвойс.Ссылка,
	             |	СкоррИнвойсы.КоличествоОборот,
	             |	СкоррИнвойсы.СуммаОборот,
	             |	СостоянияИнвойсов.Статус";
	РезультатЗапроса = Запр.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Соотв = Новый Соответствие; 
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", Выборка.Поставка, Новый Соответствие));
	КонецЦикла;    
	
	Объект.Сумма = 0;
	ВыборкаП = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаП.Следующий() Цикл
		НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
		Если НайдСоотв = Неопределено Тогда
			Соотв.Вставить(ВыборкаП.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", 0, Новый Соответствие));
			НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
		КонецЕсли;
		НайдСоотв.ПоставкиИнвойсов.Вставить(ВыборкаП.Поставка, Новый Структура("Количество,Сумма,Статус", 	ВыборкаП.Количество, ВыборкаП.Сумма, ВыборкаП.Статус));
		//+
		НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс, Поставка", ВыборкаП.Инвойс, ВыборкаП.Поставка));
		Если НайдСтроки.Количество() > 0 Тогда
			//	НайдСтроки[0].РасхождениеСумма 		= НайдСтроки[0].Сумма <> ВыборкаП.Сумма;
			//	НайдСтроки[0].РасхождениеКоличество = НайдСтроки[0].Количество <> ВыборкаП.Количество;   
			НайдСтроки[0].Количество 	= ВыборкаП.Количество;
			//НайдСтроки[0].Сумма 		= ВыборкаП.Сумма / ?(ВыборкаП.Инвойс.Курс=0, 1, ВыборкаП.Инвойс.Курс); 
			НайдСтроки[0].Сумма 		= ВыборкаП.Сумма; 
			НайдСтроки[0].Статус		= ВыборкаП.Статус;
			Объект.Сумма = Объект.Сумма + ВыборкаП.Сумма; 
		КонецЕсли;
		//-
	КонецЦикла;     
	
	КэшДанных = Новый Структура("Инвойсы", Соотв); 
	//КэшДанных.Вставить("ПоказателиИнвойсов", ПоказателиИнвойсов());
	КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветВалюты()
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		//Элементы.ВалютаЗатрат.ЦветФона = ОбщегоНазначения.ЦветВалюты(Объект.ВалютаЗатрат);   
		Элементы.ВалютаЗатрат.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.ВалютаЗатрат);
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()

	Элементы.ИнвойсыКоличество.ТекстПодвала = Объект.Инвойсы.Итог("Количество");
	Элементы.ИнвойсыСумма.ТекстПодвала = Объект.Инвойсы.Итог("Сумма");
    
КонецПроцедуры

#КонецОбласти


&НаСервере
Функция СписокРаспределенныхЗатрат()
	
	тз =  Объект.РаспределениеЗатрат.Выгрузить(,"ТоварнаяГруппа");
	тз.Свернуть("ТоварнаяГруппа");
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения( тз.ВыгрузитьКолонку("ТоварнаяГруппа") );   
	Список.Добавить(Справочники.ГруппыПодбораНоменклатуры.ПустаяСсылка());
	Возврат Список;
	
КонецФункции	

&НаКлиенте
Процедура ВводНаОснованииИнвойса(Команда)
	
	Если Элементы.Инвойсы.ТекущиеДанные <> Неопределено Тогда                                                          
		ПараметрыФормы = Новый Структура("Основание", Новый Структура("Инвойс,Поставка", Элементы.Инвойсы.ТекущиеДанные.Инвойс, Элементы.Инвойсы.ТекущиеДанные.Поставка));
		ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Установить(Команда)

	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Инвойсы.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>? 
							|Документ будет проведен.'; en = 'Set flag <Finaly>?'"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Попытка
		Объект.Окончательно = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));             
		УстановитьДоступность();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);	

КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	//// © Primus1C  06.02.2024  НАЧАЛО ►
	//Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() Тогда
	//	Если клНетДа(НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	//	Объект.Окончательно = Ложь;
	//	МояЗаписать(Ложь);    
	//	МоиИтоги();
	//	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);    
	//	Возврат;
	//КонецЕсли;
	//// © Primus1C  ОКОНЧАНИЕ ◄

	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	//
	//Сч = 0;
	//Для Каждого Стр Из Объект.Товары Цикл
	//	Нельзя = ?(НельзяРедактироватьЦену(Стр.Партия), 1, 0);
	//	Сч = Сч + Нельзя;
	//	Если Нельзя = 0 Тогда Продолжить КонецЕсли;
	//	Сообщить(НСтр("ru = 'Есть движения партии: '; en = 'Batches movements are posted: '") + гоИмя(Стр.Партия));
	//КонецЦикла;
	//
	////Если НЕ гоЕстьРоль("Оператор") Тогда
	//	Если Сч <> 0 Тогда клОшибка(НСтр("ru = 'Есть движения партий '; en = 'Batches movements are posted '") + гоИмя(Сч) + "!"); Возврат; КонецЕсли;
	////КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	//МояЗаписать(Ложь);
	Записать();
	УстановитьДоступность();

	//гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);

КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступность()
	
	Для каждого Элемент Из Элементы Цикл 
		Тип = ТипЗнч(Элемент);
		Если Тип = Тип("ПолеФормы") ИЛИ Тип = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Объект.Окончательно; 
		ИначеЕсли Тип = Тип("КнопкаФормы") И Элемент.Родитель <> Элементы.ФормаКоманднаяПанель И  Элемент.Родитель.Имя <> "МенюПечать" Тогда
			Элемент.Доступность = НЕ Объект.Окончательно;
		КонецЕсли;
	КонецЦикла;	    
	Если Элементы.Найти("Снять") <> Неопределено Тогда
		Элементы.Снять.Доступность = Объект.Окончательно;
	КонецЕсли;
	Если Элементы.Найти("Установить") <> Неопределено Тогда
		Элементы.Установить.Доступность = НЕ Объект.Окончательно;
	КонецЕсли;
	Элементы.Окончательно.ТолькоПросмотр = Истина;

КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Отправка.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИнвойсыНомерИнвойсаПоставщика" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс); 
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти


#Область Дерево

&НаСервере
Процедура ЗаполнитьДеревоЗначенийНаСервере()
	
	Дер = РеквизитФормыВЗначение("Дерево");
	Дер.Строки.Очистить();
	ИтКоличество = 0;
	ИтСумма = 0;
	ИтВес = 0;
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Затрата КАК Затрата,
	             |	ТЗ.Количество КАК Количество,
	             |	ТЗ.Цена КАК Цена,
	             |	ТЗ.Вес КАК Вес,
	             |	ТЗ.Сумма КАК Сумма
	             |ПОМЕСТИТЬ ТЗ
	             |ИЗ
	             |	&ТЧ КАК ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	             |	ОтправкаРаспределениеЗатрат.Затрата КАК Затрата,
	             |	ОтправкаРаспределениеЗатрат.Количество КАК Количество,
	             |	ОтправкаРаспределениеЗатрат.Цена КАК Цена,
	             |	ОтправкаРаспределениеЗатрат.Вес КАК Вес,
	             |	ОтправкаРаспределениеЗатрат.Сумма КАК Сумма
	             |ИЗ
	             |	ТЗ КАК ОтправкаРаспределениеЗатрат
	             |ИТОГИ
	             |	СРЕДНЕЕ(Количество),
	             |	СРЕДНЕЕ(Цена),
	             |	СРЕДНЕЕ(Вес),
	             |	СУММА(Сумма)
	             |ПО
	             |	Номенклатура,
	             |	Затрата";
	Запр.УстановитьПараметр("ТЧ", Объект.РаспределениеЗатрат.Выгрузить());
  	ВыборкаН = Запр.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаН.Следующий() Цикл
		СтрокаН = Дер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаН, ВыборкаН);
		ВыборкаЗ = ВыборкаН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗ.Следующий() Цикл
			СтрокаЗ = СтрокаН.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗ, ВыборкаЗ, "Номенклатура,Затрата,Сумма");  
		КонецЦикла;
		ИтКоличество = ИтКоличество + ВыборкаН.Количество;
		ИтСумма = ИтСумма + ВыборкаН.Сумма; 
		ИтВес = ИтВес + ВыборкаН.Вес;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дер,"Дерево");
	
	Элементы.ДеревоКоличество.ТекстПодвала = ИтКоличество;
	Элементы.ДеревоСумма.ТекстПодвала = Формат(ИтСумма, "ЧДЦ=4");
	Элементы.ДеревоВес.ТекстПодвала = Формат(ИтВес, "ЧДЦ=3");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	РаспределениеЗатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти 


#Область РаспределениеЗатрат

&НаСервереБезКонтекста
Функция ТоварнаяГруппа(Знач Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Пока Номенклатура.Уровень() > 0 Цикл
			Группа = Номенклатура.Родитель.ГруппаПодбора;
			Если ЗначениеЗаполнено(Группа) Тогда
				Возврат Группа;
			КонецЕсли;
			Номенклатура = Номенклатура.Родитель;		
		КонецЦикла; 
	КонецЕсли;
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции 

//&НаСервере
//Процедура ОтобразитьВесЗатрат(СтрокаТЧ = Неопределено)
//	
//	масСтрок = Новый Массив;
//	Если СтрокаТЧ = Неопределено Тогда 
//		масСтрок = Объект.Затраты.Выгрузить();
//		ОтобразитьВесЗатратСтроки()
//	Иначе	
//		масСтрок.Добавить(СтрокаТЧ);
//		Для каждого СтрокаТЧ Из Объект.Затраты Цикл 
//			НайдСтроки = Объект.РаспределениеЗатрат
//			СтрокаТЧ.ЦенаКг = ?(СтрокаТЧ.Вес=0, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма / СтрокаТЧ.Вес);
//		КонецЦикла;                           
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура ОтобразитьТоварныеГруппы()
	
	 Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
		 СтрокаТЧ.ТоварнаяГруппа = ТоварнаяГруппа(СтрокаТЧ.Номенклатура);
	 КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура РаспределитьЗатратыНаСервере()
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ЗНАЧЕНИЕ(Справочник.ГруппыПодбораНоменклатуры.ПустаяСсылка) КАК ТоварнаяГруппа,
	             |	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
	             |	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
	             |ГДЕ
	             |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
	             |			(ВЫБРАТЬ
	             |				ИнвойсыОтправки.Инвойс,
	             |				ИнвойсыОтправки.Поставка
	             |			ИЗ
	             |				Документ.Отправка.Инвойсы КАК ИнвойсыОтправки
	             |			ГДЕ
	             |				ИнвойсыОтправки.Ссылка = &Ссылка)
	             |	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОприходНоменклатуры.Номенклатура
	             |АВТОУПОРЯДОЧИВАНИЕ" ;
	Выгрузка = Запр.Выполнить().Выгрузить();
	Для каждого СтрокаВыгрузки Из Выгрузка Цикл
		СтрокаВыгрузки.ТоварнаяГруппа = ТоварнаяГруппа(СтрокаВыгрузки.Номенклатура);
	КонецЦикла;
	
	тзРаспределениеЗатрат = Объект.РаспределениеЗатрат.Выгрузить();
	тзРаспределениеЗатрат.Очистить();
	тзЗатраты = Объект.Затраты.Выгрузить();
	тзЗатраты.Сортировать("ТоварнаяГруппа"); 	// чтобы сначала распределять общие
	
	// распределим по каждой затрате:
	Для каждого СтрокаЗатрат Из тзЗатраты Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппа) Тогда
			СтрокиОднойГруппы = Выгрузка.НайтиСтроки(Новый Структура("ТоварнаяГруппа", СтрокаЗатрат.ТоварнаяГруппа));
		Иначе
			СтрокиОднойГруппы = Выгрузка;
		КонецЕсли;
		
		// распределим сумму затраты по весу
		ВесГруппы = 0;
		Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			ВесГруппы = ВесГруппы + СтрокаТЧ.Вес;  
		КонецЦикла;
		   
		НайдСтроки = Объект.Затраты.НайтиСтроки(Новый Структура("Затрата,Сумма,ТоварнаяГруппа",
																СтрокаЗатрат.Затрата, СтрокаЗатрат.Сумма, СтрокаЗатрат.ТоварнаяГруппа));
		Если НайдСтроки.Количество() > 0 Тогда
			НайдСтрока = НайдСтроки[0];
			НайдСтрока.Вес = ВесГруппы; 
			НайдСтрока.ЦенаКг = ?(НайдСтрока.Вес=0, НайдСтрока.Сумма, НайдСтрока.Сумма / НайдСтрока.Вес);
		КонецЕсли;
		
		к = ?(ВесГруппы=0, 0, СтрокаЗатрат.Сумма / ВесГруппы);
		Для каждого СтрокаГруппы Из СтрокиОднойГруппы Цикл
			//СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.Вес * к; 
			СтрокаТЗ = тзРаспределениеЗатрат.Добавить();
			СтрокаТЗ.Номенклатура	= СтрокаГруппы.Номенклатура;
			СтрокаТЗ.Затрата        = СтрокаЗатрат.Затрата;
			СтрокаТЗ.Количество     = СтрокаГруппы.Количество;
			СтрокаТЗ.Вес            = СтрокаГруппы.Вес;
			СтрокаТЗ.Сумма          = СтрокаГруппы.Вес * к;
		КонецЦикла;
		
	КонецЦикла;	 
	
	//тзРаспределениеЗатрат.Свернуть("Номенклатура,Затрата,Вес", "Количество,Сумма,Цена");
	тзРаспределениеЗатрат.Свернуть("Номенклатура,Затрата,Количество,Вес,Цена", "Сумма");
	Для каждого СтрокаТЗ Из тзРаспределениеЗатрат Цикл
		СтрокаТЗ.Цена = СтрокаТЗ.Сумма / СтрокаТЗ.Количество;
	КонецЦикла; 
	тзРаспределениеЗатрат.Сортировать("Номенклатура,Затрата");
	Объект.РаспределениеЗатрат.Загрузить(тзРаспределениеЗатрат);
	
	ЗаполнитьДеревоЗначенийНаСервере();
	ВОЗВРАТ;
	
	
	
	
	
	////////////////////////////////////
	
	лВыводитьСообщения = РольДоступна("Администратор");
	лВыводитьСообщения = Ложь;
	
	// заполним вес нетто
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
				|	ОприходНоменклатуры.Номенклатура,
				|	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
				|	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес
				|ИЗ
				|	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
				|ГДЕ
				|	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
				|			(ВЫБРАТЬ
				|				ИнвойсыОтправки.Инвойс,
				|				ИнвойсыОтправки.Поставка
				|			ИЗ
				|				Документ.Отправка.Инвойсы КАК ИнвойсыОтправки
				|			ГДЕ
				|				ИнвойсыОтправки.Ссылка = &Ссылка)
				|	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
				|
				|СГРУППИРОВАТЬ ПО
				|	ОприходНоменклатуры.Номенклатура
				|АВТОУПОРЯДОЧИВАНИЕ" ;
	 Объект.РаспределениеЗатрат.Загрузить(Запр.Выполнить().Выгрузить());
	 ОтобразитьТоварныеГруппы();
	 
	 тзЗатраты = Объект.Затраты.Выгрузить();
	 тзЗатраты.Сортировать("ТоварнаяГруппа"); 	// чтобы сначала распределять общие
	 
	 // распределим по каждой затрате:
	 Для каждого СтрокаЗатрат Из тзЗатраты Цикл
		 
		 Если лВыводитьСообщения Тогда
			Сообщить(СтрШаблон("Стр.%1. Распределение группы <%2> (сумма %3):", СтрокаЗатрат.НомерСтроки, СтрокаЗатрат.ТоварнаяГруппа, Формат(СтрокаЗатрат.Сумма,"ЧДЦ=2")));			 
		 КонецЕсли;   
		 
		 Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппа) Тогда
			 
			 СтрокиОднойГруппы = Объект.РаспределениеЗатрат.НайтиСтроки(Новый Структура("ТоварнаяГруппа", СтрокаЗатрат.ТоварнаяГруппа));
			 
		 Иначе
			 
			 СтрокиОднойГруппы = Объект.РаспределениеЗатрат;
			 
		 КонецЕсли;
		 
		 // распределим сумму затраты по весу
		 ВесГруппы 	= 0;
		 Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			 ВесГруппы 	= ВесГруппы + СтрокаТЧ.Вес;  
		 КонецЦикла;
			 //+  
			 НайдСтроки = Объект.Затраты.НайтиСтроки(Новый Структура("Затрата,Сумма,ТоварнаяГруппа",СтрокаЗатрат.Затрата,СтрокаЗатрат.Сумма,СтрокаЗатрат.ТоварнаяГруппа));
			 Если НайдСтроки.Количество() > 0 Тогда
				 НайдСтрока = НайдСтроки[0];
				 НайдСтрока.Вес = ВесГруппы; 
				 НайдСтрока.ЦенаКг = ?(НайдСтрока.Вес=0, НайдСтрока.Сумма, НайдСтрока.Сумма / НайдСтрока.Вес);
			 КонецЕсли;
			 //-
		 к = ?(ВесГруппы=0, 0, СтрокаЗатрат.Сумма / ВесГруппы);
		 Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл
			 СтрокаТЧ.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.Вес * к;
			 Если лВыводитьСообщения Тогда
				 Сообщить(СтрШаблон("   стр.%1 '%2': +%3", СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура, Формат(СтрокаТЧ.Вес * к, "ЧДЦ=5")));			 
			 КонецЕсли;   
		 КонецЦикла;
		 
	 КонецЦикла;                               
	 
	 Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл
	 	СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
	 КонецЦикла;
	 
	 Для каждого СтрокаТЧ Из Объект.Затраты Цикл
	 	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТоварнаяГруппа) Тогда
			СтрокаТЧ.Вес = 0;
		КонецЕсли;
	 КонецЦикла;
	 
	 УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	//Если Элементы.Найти("Затраты") = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;	
	//	
	//УО = ЭтаФорма.УсловноеОформление; 
	//УО.Элементы.Очистить(); 
	//ЭлементУО = УО.Элементы.Добавить(); 
	//
	//	Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//	Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыГруппаНоменклатуры.Имя);
	//	Оформляемоеполе.Использование = ИСТИНА;  
	//
	//Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыЗатрата.Имя);
	//Оформляемоеполе.Использование = ИСТИНА;  
	//
	//Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыСумма.Имя);
	//Оформляемоеполе.Использование = ИСТИНА;  
	//
	//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных("Объект.Затраты.ТоварнаяГруппа");
	//ЭлементУсловия.ПравоеЗначение  = КэшДанных.СписокРаспределенныхЗатрат;
	//ЭлементУсловия.ВидСравнения    = ВидСравненияКомпоновкиДанных.НеВСписке;   
	//ЭлементУсловия.Использование   = Истина;    
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.Красный); 

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатраты(Команда)  
	
	////Ошибки = Новый СписокЗначений;
	////Для каждого СтрокаТЧ Из Объект.Затраты Цикл
	////	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТоварнаяГруппа) И ЗначениеЗаполнено(СтрокаТЧ.Вес) Тогда
	////		Ошибки.Добавить(СтрШаблон("Строка %1: вес брутто д.быть заполнен только для товарной группы", СтрокаТЧ.НомерСтроки)); 
	////	КонецЕсли;
	////КонецЦикла;
	////Если Ошибки.Количество() > 0 Тогда
	////    Для каждого Эл Из Ошибки Цикл
	////		Сообщить(Эл.Значение);
	////	КонецЦикла;
	////	Сообщить("Распределение не выполнено!");
	////	Возврат;
	////КонецЕсли;
	//
	//Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
	// 	Если НЕ клДаНет("Табличная часть 'Распределение' будет перезаполнена. Продолжить?") Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;      
	//Если Модифицированность Тогда
	// 	Если НЕ клДаНет("Документ будет записан. Продолжить?") Тогда
	//		Возврат;
	//	КонецЕсли; 
	//	Записать();
	//КонецЕсли;      
	//
	//РаспределитьЗатратыНаСервере();  
	//КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	//Модифицированность = Истина;
	
	Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
		клДаНет(Новый ОписаниеОповещения("РаспределитьЗатратыПослеПроверкиРаспределения", ЭтотОбъект), "Табличная часть 'Распределение' будет перезаполнена. Продолжить?");
		Возврат;
	КонецЕсли;      
	
	РаспределитьЗатратыШаг2();

КонецПроцедуры
 
&НаКлиенте
Процедура РаспределитьЗатратыПослеПроверкиРаспределения(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	РаспределитьЗатратыШаг2();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыШаг2()
	Если Модифицированность Тогда
		клДаНет(Новый ОписаниеОповещения("РаспределитьЗатратыПослеПроверкиЗаписи", ЭтотОбъект), "Документ будет записан. Продолжить?");
		Возврат;
	КонецЕсли;      
	
	РаспределитьЗатратыШаг3();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыПослеПроверкиЗаписи(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Записать();
	РаспределитьЗатратыШаг3();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыШаг3()
	РаспределитьЗатратыНаСервере();  
	КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РаспределениеЗатратПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Данные = Элементы.Затраты.Текущиеданные; 	
		Данные.Затрата = гоКонстанта("НоменклатураУслугаДоставки");	
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ИнфоЗатрат(Номенклатура)
	
	Мас = Новый Массив;
	Запр = Новый Запрос;	
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
    Запр.Текст = "ВЫБРАТЬ
                 |	ОприходНоменклатуры.Документ КАК Документ,
                 |	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
                 |	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес,
                 |	ОприходНоменклатуры.Поставка
                 |ИЗ
                 |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
                 |ГДЕ
                 |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
                 |			(ВЫБРАТЬ
                 |				ИнвойсыОтправки.Инвойс,
                 |				ИнвойсыОтправки.Поставка
                 |			ИЗ
                 |				Документ.Отправка.Инвойсы КАК ИнвойсыОтправки
                 |			ГДЕ
                 |				ИнвойсыОтправки.Ссылка = &Ссылка)
                 |	И ОприходНоменклатуры.Номенклатура = &Номенклатура
                 |
                 |СГРУППИРОВАТЬ ПО
                 |	ОприходНоменклатуры.Документ,
                 |	ОприходНоменклатуры.Поставка
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	ОприходНоменклатуры.Документ.Дата" ;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Мас.Добавить(Новый Структура("Инвойс,Поставка,Количество,Вес", Выборка.Документ, Выборка.Поставка, Выборка.Количество, Выборка.Вес));	
	КонецЦикла;	
	Возврат Мас;
	
КонецФункции

&НаКлиенте
Процедура РаспределениеЗатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	мас = ИнфоЗатрат(Элемент.ТекущиеДанные.Номенклатура);
	ТекстСообщения = СтрШаблон("%1 %2", НСтр("ru = 'Вхождения'; en = 'Entering'"), Элемент.ТекущиеДанные.Номенклатура); 
	ТекстПояснения = "";
	Для каждого эл Из Мас Цикл
		ТекстПояснения = ТекстПояснения + СтрШаблон(НСтр("ru = '%1 (%2):
													|к-во %3, 
													|вес %4 кг'; en = '%1 (%2): 
													|amnt. %3, 
													|weigth %4 kg'"), 
													эл.Инвойс, 
													?( эл.Поставка=0, НСтр("ru = 'целиком'; en = 'entirely'"), НСтр("ru = 'поставка '; en = 'delivivery '") + эл.Поставка ),
													эл.Количество, 
													эл.Вес) 
										+ Символы.ПС;
	КонецЦикла;
	//клНамекнуть(ТекстСообщения, ТекстПояснения, БиблиотекаКартинок.Информация);
	клПредупреждение(ТекстПояснения, , ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄
